1s/ERP/Conf/Documents/Лико_Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_Инвентаризация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_АдресноеХранение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПересчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтборПересчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровестиТолькоПоАдресномуХранению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Содержимое</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Паллет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Паллеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодСерии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/ЯС_ВидыШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЯС_ВидыШК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Управляющий</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Коробки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Сотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Заказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_УпаковочныйЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаявкаНаСклад</Name>
					<Comment>Старая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерБобины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_КодПродукта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_ИнформацияОПродукте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_УпотребитьДо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_Roll_ID</Name>
					<Comment>Штрих-код EPSMA Roll ID короткий. (Правай часть от Roll Number)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_Товароместо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_РабочегоЦентра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ПриходРасходТовароместа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ТовароместоUID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаказаСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Конверта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_СотрудникаПолныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ВходящихДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Растарки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_КартаСнятияПерерасхода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ТипоразмерПаллета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета2_0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_Инвентаризация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущиеДанные = Неопределено;
	Иначе
		ТекущиеДанные = Объект.Содержимое.НайтиПоИдентификатору(ТекущаяСтрока);
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаТовары;
	
	//Найдем серию
	МассивСерий = Лико_Дополнительно.НайтиСерииПоШтрихкоду(ДанныеШтрихкода.Штрихкод);
	СерияНайдена = МассивСерий.Количество() > 0;
	Если СерияНайдена Тогда
		Отказ = Ложь;
		Если НЕ ЗначениеЗаполнено(ТекущаяЯчейка) Тогда
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не заполнена ячейка!");
			Отказ = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущийПаллет) Тогда
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не заполнен паллет!");
			Отказ = Истина;
		КонецЕсли;
		Если ТекущиеДанные = Неопределено Тогда
			Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Ошибка. Не найдена текущая строка.");
			Отказ = Истина;
		КонецЕсли;			
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Для каждого Серия из МассивСерий Цикл
			Если Объект.Содержимое.НайтиСтроки(Новый Структура("Серия", Серия)).Количество() = 0 Тогда
				Если ЗначениеЗаполнено(ТекущиеДанные.Серия) ИЛИ ЗначениеЗаполнено(ТекущиеДанные.ШтрихкодСерии) Тогда
					ТекущиеДанные = Объект.Содержимое.Добавить();
					ТекущиеДанные.Ячейка = ТекущаяЯчейка;
					ТекущиеДанные.Паллет = ТекущийПаллет;
					Элементы.Содержимое.ТекущаяСтрока = ТекущиеДанные.ПолучитьИдентификатор();
				КонецЕсли;
				ТекущиеДанные.Серия = Серия;
			Иначе
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Серия """ + Серия + """ уже присутствует в таблице.");
			КонецЕсли;
		КонецЦикла;
		КоличествоКоробок = РассчитатьКоличествоКоробок();
	Иначе
		Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
		Если Результат.Ошибка <> "" Тогда
			// Если это штрихкод серии, запишем его в колонку ШтрихкодСерии
			Если СтрДлина(ДанныеШтрихкода.Штрихкод) = 20 Тогда
				Если ТекущиеДанные = Неопределено Тогда
					Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Ошибка. Не найдена текущая строка.");
					Отказ = Истина;
				Иначе
					Если Объект.Содержимое.НайтиСтроки(Новый Структура("ШтрихкодСерии", ДанныеШтрихкода.Штрихкод)).Количество() = 0 Тогда
						ТекущиеДанные = Объект.Содержимое.Добавить();
						ТекущиеДанные.Ячейка = ТекущаяЯчейка;
						ТекущиеДанные.Паллет = ТекущийПаллет;
						ТекущиеДанные.ШтрихкодСерии = ДанныеШтрихкода.Штрихкод;
						Элементы.Содержимое.ТекущаяСтрока = ТекущиеДанные.ПолучитьИдентификатор();
					Иначе
						Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Штрихкод """ + ДанныеШтрихкода.Штрихкод + """ уже присутствует в таблице.");
					КонецЕсли;
				КонецЕсли;
			Иначе
				Сообщить(Результат.Ошибка);
			КонецЕсли;
		Иначе
			Если Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Паллета") Тогда
				//Это паллет
				Если ТекущийПаллет = Результат.Паллет Тогда
					Возврат;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ТекущаяЯчейка) Тогда
					Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Сначала нужно отсканировать штрихкод ячейки.");
					Возврат;
				КонецЕсли;
				Если Объект.Содержимое.Количество() > 0 И ТекущиеДанные = Неопределено Тогда
					Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Ошибка. Не найдена текущая строка.");
					Возврат;
				КонецЕсли;
				Если ЗначениеЗаполнено(ТекущиеДанные.Серия) Тогда
					Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Уже введена информация о паллете. Сканируйте коробки или новую ячейку.");
					Возврат;
				КонецЕсли;	
				НайденныеСтроки = Объект.Содержимое.НайтиСтроки(Новый Структура("Паллет", Результат.Паллет));
				Если НайденныеСтроки.Количество() = 0 Тогда
					ТекущиеДанные.Паллет = Результат.Паллет;
					СодержимоеПриАктивизацииСтроки(Неопределено);
				Иначе
					Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Паллет """ + Результат.Паллет + """ уже присутствует в таблице. Считайте другой паллет или продолжайте сканировать коробки этого паллета (они будут помещены в ячейку """ + НайденныеСтроки[0].Ячейка + """.");
					Элементы.Содержимое.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
					СодержимоеПриАктивизацииСтроки(Неопределено);
				КонецЕсли;
			ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса")
				ИЛИ Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Адреса_Короткий") Тогда
				//Это ячейка
				Если ТекущаяЯчейка = Результат.АдресаХранения Тогда
					Возврат;
				КонецЕсли;
				НайденныеСтроки = Объект.Содержимое.НайтиСтроки(Новый Структура("Ячейка", Результат.АдресаХранения));
				Если НайденныеСтроки.Количество() = 0 Тогда
					СкладВладелец = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Результат.АдресаХранения.Владелец", Результат, "Результат");
					Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
						Объект.Склад = СкладВладелец;
					КонецЕсли;
					Если СкладВладелец <> Объект.Склад Тогда
						Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Считана ячейка склада, отличного от выбранного в документе.");
						Возврат;
					КонецЕслИ;
					ТекущиеДанные = Объект.Содержимое.Добавить();
					ТекущиеДанные.Ячейка = Результат.АдресаХранения;
					Элементы.Содержимое.ТекущаяСтрока = ТекущиеДанные.ПолучитьИдентификатор();
				Иначе
					Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Ячейка """ + Результат.АдресаХранения + """ уже присутствует в таблице. Считайте другую ячейку или продолжайте сканировать коробки в эту ячейку (они будут принадлежать уже введенному паллету """ + НайденныеСтроки[0].Паллет + """.");
					Элементы.Содержимое.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
					СодержимоеПриАктивизацииСтроки(Неопределено);
				КонецЕсли;
			ИначеЕсли Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
				//Это физ. лицо
				Объект.АвторДокумента = Результат.Сотрудник;
				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновное;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИнициализироватьКомпоновкуДанных(Ложь);
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	УстановитьДоступностьЭлементов();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.РабочееМесто = ПараметрыСеанса.Лико_РабочееМесто;
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Объект.Организация = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяОрганизация", ТекущийПользователь); 
		Объект.Подразделение = ТекущийПользователь.Подразделение;
		Объект.Склад = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента("ДопРеквизитПользователяСГП", ТекущийПользователь);
		Параметры.Свойство("ФизЛицо", Объект.АвторДокумента);
	КонецЕсли;
	КоличествоКоробок = РассчитатьКоличествоКоробок();
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойДокумент) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ТиповойДокумент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Элементы.ТиповыеДокументы.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураПоШтрихкоду(ПараметрыОбработки, КэшированныеЗначения)
	
	Возврат ШтрихкодированиеНоменклатурыСервер.НоменклатураПоШтрихкоду(ПараметрыОбработки, КэшированныеЗначения); 
	
КонецФункции

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СодержимоеПриИзменении(Элемент)
	КоличествоКоробок = РассчитатьКоличествоКоробок();
КонецПроцедуры

&НаСервере
Функция РассчитатьКоличествоКоробок()
	
	Возврат Лико_Дополнительно.РассчитатьКоличествоКоробокВТЗ(Объект.Содержимое.Выгрузить(, "Серия"));

КонецФункции

&НаКлиенте
Процедура СодержимоеПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элементы.Содержимое.ТекущаяСтрока;
	ТекущиеДанные = Элементы.Содержимое.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущаяЯчейка = ТекущиеДанные.Ячейка;
		ТекущийПаллет = ТекущиеДанные.Паллет;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()
	
	ИнициализироватьКомпоновкуДанных(Ложь);
	
	//проверим все ли ячейки принадлежат данному складу
	ВсеЯчейкиПринадлежатСкладу = Истина;
	Для каждого Строка из Объект.Содержимое Цикл
		Если Строка.Ячейка.Владелец <> Объект.Склад Тогда
			ВсеЯчейкиПринадлежатСкладу = Ложь;
			Строка.Ячейка = Неопределено;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ВсеЯчейкиПринадлежатСкладу Тогда
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не все ячейки принадлежат выбранному в шапке складу, такие ячейки очищены.");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	СкладПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ОтборПересчета = Новый ХранилищеЗначения(ОтборПересчета.Настройки, Новый СжатиеДанных(9));
	ТекущийОбъект.ПредставлениеОтборПересчета = Строка(ОтборПересчета.Настройки.Отбор);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ИнициализироватьКомпоновкуДанных(Ложь);
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию)
	
	ИспользоватьАдресноеХранение = Истина;
	
	Если ИспользоватьАдресноеХранение Тогда
		СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаПоЯчейкам");
	Иначе
		СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаПоСкладу");
	КонецЕсли;
	
	//Оставим только нужные нам поля
	МассивДоступныхПолей = Новый Массив;
	МассивДоступныхПолей.Добавить("Ячейка");
	МассивУдаляемых = Новый Массив;
	Для каждого Элемент из СхемаКомпоновкиДанных.НаборыДанных.ЗаполнениеПоОтборам.Поля Цикл
		Если МассивДоступныхПолей.Найти(Строка(Элемент.Поле)) = Неопределено Тогда
			Элемент.ОграничениеИспользования.Условие = Истина;
			Элемент.ОграничениеИспользованияРеквизитов.Условие = Истина;
		КонецЕсли;
	КонецЦикла;
	Для каждого Элемент из СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы Цикл
		Если МассивДоступныхПолей.Найти(Строка(Элемент.ЛевоеЗначение)) = Неопределено Тогда
			МассивУдаляемых.Добавить(Элемент);     
		КонецЕсли;
	КонецЦикла;
	Для каждого Элемент из МассивУдаляемых Цикл
		СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор.Элементы.Удалить(Элемент);	
	КонецЦикла;
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборПересчета.Инициализировать(ИсточникНастроек);
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекНастройки = ТекОбъект.ОтборПересчета.Получить();
	Если ТекНастройки = Неопределено
		Или ВсегдаИспользоватьНастройкиПоУмолчанию Тогда
		ОтборПересчета.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборПересчета.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	
	ОтборПересчета.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	УстановитьЗначениеПараметраНастроек(ОтборПересчета.Настройки, "Склад" , Объект.Склад);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПараметраНастроек(Настройки, ИмяПараметра, Значение)
	
	Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Значение;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры
